---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.RevitServerModelAlreadyExistsException
source: html/2c6f3673-419d-df6e-cce4-865c5a1d21af.htm
---
# RevitServerModelAlreadyExistsException Methods

Retrieves data needed to serialize the target object.